summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMtu_bf.h
/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1PCMAP */
#define IFX_MTU_MEMMAP_CPU1PCMAP_OFF (10)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1PTMAP */
#define IFX_MTU_MEMMAP_CPU1PTMAP_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_LEN (2)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_MSK (0x3)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_LEN (2)

/** \\brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_MSK (0x3)

/** \\brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2xAIU */
#define IFX_MTU_MEMSTAT0_CPU2XAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2xAIU */
#define IFX_MTU_MEMSTAT0_CPU2XAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2xAIU */
#define IFX_MTU_MEMSTAT0_CPU2XAIU_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMxAIU */
#define IFX_MTU_MEMSTAT0_HSMXAIU_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMxAIU */
#define IFX_MTU_MEMSTAT0_HSMXAIU_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMxAIU */
#define IFX_MTU_MEMSTAT0_HSMXAIU_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_OFF (27)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_LEN (1)

