summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMtu_bf.h
/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DSEN */
#define IFX_MTU_MEMTEST0_CPU1DSEN_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1DTEN */
#define IFX_MTU_MEMTEST0_CPU1DTEN_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PSEN */
#define IFX_MTU_MEMTEST0_CPU1PSEN_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1PTEN */
#define IFX_MTU_MEMTEST0_CPU1PTEN_OFF (11)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_LEN (6)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_MSK (0x3f)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_LEN (2)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_MSK (0x3)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_OFF (26)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_OFF (31)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_OFF (28)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_OFF (29)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_OFF (30)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_OFF (13)

/** \\brief  Length for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML4EN */
#define IFX_MTU_MEMTEST1_EMEML4EN_OFF (18)

