summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMtu_bf.h
/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML5EN */
#define IFX_MTU_MEMTEST1_EMEML5EN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML6EN */
#define IFX_MTU_MEMTEST1_EMEML6EN_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML7EN */
#define IFX_MTU_MEMTEST1_EMEML7EN_OFF (21)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_LEN (8)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_MSK (0xff)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_LEN (2)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_MSK (0x3)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_OFF (30)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_OFF (8)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_OFF (6)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_OFF (7)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_LEN (3)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_MSK (0x7)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_OFF (9)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_OFF (1)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_OFF (4)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_OFF (5)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_OFF (13)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_OFF (2)

/** \\brief  Length for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_OFF (12)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_OFF (14)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF1EN */
#define IFX_MTU_MEMTEST2_CIF1EN_OFF (16)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF2EN */
#define IFX_MTU_MEMTEST2_CIF2EN_OFF (17)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_OFF (15)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_OFF (19)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_LEN (14)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_MSK (0x3fff)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_OFF (0)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_OFF (22)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_OFF (23)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_OFF (18)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_OFF (20)

/** \\brief  Length for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_LEN (1)

/** \\brief  Mask for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_MSK (0x1)

/** \\brief  Offset for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_OFF (21)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMTU_BF_H */
